## Plan Result (prod-shared-image-gallery)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 13 to add, 0 to change, 6 to destroy.</code></pre>

* Create
  * azurerm_managed_disk.managed_disk[&#34;bastion-ubuntu&#34;]
  * azurerm_managed_disk.managed_disk[&#34;devops-ubuntu&#34;]
  * azurerm_managed_disk.managed_disk[&#34;jenkins-agent&#34;]
  * azurerm_managed_disk.managed_disk[&#34;jenkins-ubuntu&#34;]
  * azurerm_shared_image.shared_image[&#34;devops-ubuntu&#34;]
  * azurerm_shared_image_version.image_version[&#34;devops-ubuntu&#34;]
  * azurerm_snapshot.snapshot[&#34;devops-ubuntu&#34;]
* Replace
  * azurerm_shared_image_version.image_version[&#34;bastion-ubuntu&#34;]
  * azurerm_shared_image_version.image_version[&#34;jenkins-agent&#34;]
  * azurerm_shared_image_version.image_version[&#34;jenkins-ubuntu&#34;]
  * azurerm_snapshot.snapshot[&#34;bastion-ubuntu&#34;]
  * azurerm_snapshot.snapshot[&#34;jenkins-agent&#34;]
  * azurerm_snapshot.snapshot[&#34;jenkins-ubuntu&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_managed_disk.managed_disk["bastion-ubuntu"] will be created
  + resource "azurerm_managed_disk" "managed_disk" {
      + create_option                 = "Empty"
      + disk_iops_read_only           = (known after apply)
      + disk_iops_read_write          = (known after apply)
      + disk_mbps_read_only           = (known after apply)
      + disk_mbps_read_write          = (known after apply)
      + disk_size_gb                  = 1
      + id                            = (known after apply)
      + location                      = "uksouth"
      + logical_sector_size           = (known after apply)
      + max_shares                    = (known after apply)
      + name                          = "bastion-ubuntu-disk"
      + public_network_access_enabled = true
      + resource_group_name           = "hmcts-image-gallery-rg"
      + source_uri                    = (known after apply)
      + storage_account_type          = "Standard_LRS"
      + tier                          = (known after apply)
    }

  # azurerm_managed_disk.managed_disk["devops-ubuntu"] will be created
  + resource "azurerm_managed_disk" "managed_disk" {
      + create_option                 = "Empty"
      + disk_iops_read_only           = (known after apply)
      + disk_iops_read_write          = (known after apply)
      + disk_mbps_read_only           = (known after apply)
      + disk_mbps_read_write          = (known after apply)
      + disk_size_gb                  = 1
      + id                            = (known after apply)
      + location                      = "uksouth"
      + logical_sector_size           = (known after apply)
      + max_shares                    = (known after apply)
      + name                          = "devops-ubuntu-disk"
      + public_network_access_enabled = true
      + resource_group_name           = "hmcts-image-gallery-rg"
      + source_uri                    = (known after apply)
      + storage_account_type          = "Standard_LRS"
      + tier                          = (known after apply)
    }

  # azurerm_managed_disk.managed_disk["jenkins-agent"] will be created
  + resource "azurerm_managed_disk" "managed_disk" {
      + create_option                 = "Empty"
      + disk_iops_read_only           = (known after apply)
      + disk_iops_read_write          = (known after apply)
      + disk_mbps_read_only           = (known after apply)
      + disk_mbps_read_write          = (known after apply)
      + disk_size_gb                  = 1
      + id                            = (known after apply)
      + location                      = "uksouth"
      + logical_sector_size           = (known after apply)
      + max_shares                    = (known after apply)
      + name                          = "jenkins-agent-disk"
      + public_network_access_enabled = true
      + resource_group_name           = "hmcts-image-gallery-rg"
      + source_uri                    = (known after apply)
      + storage_account_type          = "Standard_LRS"
      + tier                          = (known after apply)
    }

  # azurerm_managed_disk.managed_disk["jenkins-ubuntu"] will be created
  + resource "azurerm_managed_disk" "managed_disk" {
      + create_option                 = "Empty"
      + disk_iops_read_only           = (known after apply)
      + disk_iops_read_write          = (known after apply)
      + disk_mbps_read_only           = (known after apply)
      + disk_mbps_read_write          = (known after apply)
      + disk_size_gb                  = 1
      + id                            = (known after apply)
      + location                      = "uksouth"
      + logical_sector_size           = (known after apply)
      + max_shares                    = (known after apply)
      + name                          = "jenkins-ubuntu-disk"
      + public_network_access_enabled = true
      + resource_group_name           = "hmcts-image-gallery-rg"
      + source_uri                    = (known after apply)
      + storage_account_type          = "Standard_LRS"
      + tier                          = (known after apply)
    }

  # azurerm_shared_image.shared_image["devops-ubuntu"] will be created
  + resource "azurerm_shared_image" "shared_image" {
      + architecture        = "x64"
      + gallery_name        = "hmcts"
      + hyper_v_generation  = "V2"
      + id                  = (known after apply)
      + location            = "uksouth"
      + name                = "devops-ubuntu"
      + os_type             = "Linux"
      + resource_group_name = "hmcts-image-gallery-rg"

      + identifier {
          + offer     = "devops-ubuntu"
          + publisher = "hmcts"
          + sku       = "22.04-LTS"
        }
    }

  # azurerm_shared_image_version.image_version["bastion-ubuntu"] must be replaced
-/+ resource "azurerm_shared_image_version" "image_version" {
      ~ id                  = "/subscriptions/2b1afc19-5ca9-4796-a56f-574a58670244/resourceGroups/hmcts-image-gallery-rg/providers/Microsoft.Compute/galleries/hmcts/images/bastion-ubuntu/versions/1.0.0" -> (known after apply)
        name                = "1.0.0"
      ~ os_disk_snapshot_id = "/subscriptions/2b1afc19-5ca9-4796-a56f-574a58670244/resourceGroups/hmcts-image-gallery-rg/providers/Microsoft.Compute/snapshots/bastion-ubuntu-snapshot" # forces replacement -> (known after apply)
      - tags                = {} -> null
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_shared_image_version.image_version["devops-ubuntu"] will be created
  + resource "azurerm_shared_image_version" "image_version" {
      + exclude_from_latest = false
      + gallery_name        = "hmcts"
      + id                  = (known after apply)
      + image_name          = "devops-ubuntu"
      + location            = "uksouth"
      + name                = "1.0.0"
      + os_disk_snapshot_id = (known after apply)
      + replication_mode    = "Full"
      + resource_group_name = "hmcts-image-gallery-rg"

      + target_region {
          + name                   = "uksouth"
          + regional_replica_count = 1
          + storage_account_type   = "Standard_LRS"
        }
    }

  # azurerm_shared_image_version.image_version["jenkins-agent"] must be replaced
-/+ resource "azurerm_shared_image_version" "image_version" {
      ~ id                  = "/subscriptions/2b1afc19-5ca9-4796-a56f-574a58670244/resourceGroups/hmcts-image-gallery-rg/providers/Microsoft.Compute/galleries/hmcts/images/jenkins-agent/versions/1.0.0" -> (known after apply)
        name                = "1.0.0"
      ~ os_disk_snapshot_id = "/subscriptions/2b1afc19-5ca9-4796-a56f-574a58670244/resourceGroups/hmcts-image-gallery-rg/providers/Microsoft.Compute/snapshots/jenkins-agent-snapshot" # forces replacement -> (known after apply)
      - tags                = {} -> null
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_shared_image_version.image_version["jenkins-ubuntu"] must be replaced
-/+ resource "azurerm_shared_image_version" "image_version" {
      ~ id                  = "/subscriptions/2b1afc19-5ca9-4796-a56f-574a58670244/resourceGroups/hmcts-image-gallery-rg/providers/Microsoft.Compute/galleries/hmcts/images/jenkins-ubuntu/versions/1.0.0" -> (known after apply)
        name                = "1.0.0"
      ~ os_disk_snapshot_id = "/subscriptions/2b1afc19-5ca9-4796-a56f-574a58670244/resourceGroups/hmcts-image-gallery-rg/providers/Microsoft.Compute/snapshots/jenkins-ubuntu-snapshot" # forces replacement -> (known after apply)
      - tags                = {} -> null
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_snapshot.snapshot["bastion-ubuntu"] must be replaced
-/+ resource "azurerm_snapshot" "snapshot" {
      ~ disk_size_gb           = 1 -> (known after apply)
      ~ id                     = "/subscriptions/2b1afc19-5ca9-4796-a56f-574a58670244/resourceGroups/hmcts-image-gallery-rg/providers/Microsoft.Compute/snapshots/bastion-ubuntu-snapshot" -> (known after apply)
        name                   = "bastion-ubuntu-snapshot"
      ~ source_uri             = "/subscriptions/2b1afc19-5ca9-4796-a56f-574a58670244/resourceGroups/hmcts-image-gallery-rg/providers/Microsoft.Compute/disks/bastion-ubuntu-disk" # forces replacement -> (known after apply)
      - tags                   = {} -> null
      ~ trusted_launch_enabled = false -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # azurerm_snapshot.snapshot["devops-ubuntu"] will be created
  + resource "azurerm_snapshot" "snapshot" {
      + create_option          = "Copy"
      + disk_size_gb           = (known after apply)
      + id                     = (known after apply)
      + location               = "uksouth"
      + name                   = "devops-ubuntu-snapshot"
      + resource_group_name    = "hmcts-image-gallery-rg"
      + source_uri             = (known after apply)
      + trusted_launch_enabled = (known after apply)
    }

  # azurerm_snapshot.snapshot["jenkins-agent"] must be replaced
-/+ resource "azurerm_snapshot" "snapshot" {
      ~ disk_size_gb           = 1 -> (known after apply)
      ~ id                     = "/subscriptions/2b1afc19-5ca9-4796-a56f-574a58670244/resourceGroups/hmcts-image-gallery-rg/providers/Microsoft.Compute/snapshots/jenkins-agent-snapshot" -> (known after apply)
        name                   = "jenkins-agent-snapshot"
      ~ source_uri             = "/subscriptions/2b1afc19-5ca9-4796-a56f-574a58670244/resourceGroups/hmcts-image-gallery-rg/providers/Microsoft.Compute/disks/jenkins-agent-disk" # forces replacement -> (known after apply)
      - tags                   = {} -> null
      ~ trusted_launch_enabled = false -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # azurerm_snapshot.snapshot["jenkins-ubuntu"] must be replaced
-/+ resource "azurerm_snapshot" "snapshot" {
      ~ disk_size_gb           = 1 -> (known after apply)
      ~ id                     = "/subscriptions/2b1afc19-5ca9-4796-a56f-574a58670244/resourceGroups/hmcts-image-gallery-rg/providers/Microsoft.Compute/snapshots/jenkins-ubuntu-snapshot" -> (known after apply)
        name                   = "jenkins-ubuntu-snapshot"
      ~ source_uri             = "/subscriptions/2b1afc19-5ca9-4796-a56f-574a58670244/resourceGroups/hmcts-image-gallery-rg/providers/Microsoft.Compute/disks/jenkins-ubuntu-disk" # forces replacement -> (known after apply)
      - tags                   = {} -> null
      ~ trusted_launch_enabled = false -> (known after apply)
        # (3 unchanged attributes hidden)
    }

Plan: 13 to add, 0 to change, 6 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":14,"Program":"tfcmt","SHA1":"","Target":"prod-shared-image-gallery","Vars":{}} -->